examples_prescribed_oscillation/3D_RM6_oscil_surge/T13.75/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../flowParams";

simulationType  $simType;

// Additional models: kEpsilonMultiphase, kOmegaSSTMultiphase,
// kOmegaSSTBuoyancy, kOmegaSSTStable.

RAS
{
    RASModel        $turbModel;	

    turbulence      on;
    
    printCoeffs     on;
}

// ************************************************************************* //
